# Specifications - Database

Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 & 2 of the project, and wants you to create a MySQL database for them.

Specifically, they want the data from the following files included in your database:
- [x] Title Basics:
 -  Movie ID (tconst)
 -  Primary Title
 -  Start Year
 -  Runtime (in Minutes)
 -  Genres
- [x] Title Ratings
  - Movie ID (tconst)
  - Average Movie Rating
  - Number of Votes
- [x] The TMDB API Results (multiple files)
  - Movie ID
  -  Revenue
  -  Budget
  - Certification (MPAA Rating)

- You should normalize the tables as best you can before adding them to your new database.
 - [x] Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).
  - [x]  You only need to keep the imdb_id, revenue, budget, and certification columns

# Import Classes and Data

In [1]:
import pandas as pd
import numpy as np
import pymysql
import json
from sqlalchemy import create_engine
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists

In [2]:
#Load the data files
basics = pd.read_csv('Data/title_basics.csv.gz')
akas = pd.read_csv('Data/title_akas.csv.gz')
ratings = pd.read_csv('Data/title_ratings.csv.gz')
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')

# Custom Functions

## `df_to_sql`

In [3]:
def df_to_sql(df,primary=None):
    sql_schema = {key: None for key in df.columns}
    #Create schema to convert col.dtype to sql-types
    for col in df.columns:
       # print (f"{col} is type:{basics[col].dtype}")
        if df[col].dtype == "int64":
            sql_schema[col]=Integer()
        elif df[col].dtype == "float64":
            sql_schema[col]=Float()
        elif df[col].dtype == "object":
            sql_schema[col]=Text(df[col].fillna('').map(len).max()+1)
    if primary != None:
        #Change the primary key to type String(length=...)
        sql_schema[primary] = String(df[primary].fillna('').map(len).max()+1)
    return sql_schema

# Create Connection to DB and Engine

In [4]:
# Create connection string using credentials following this format
connection_str = "mysql+pymysql://root:root@localhost/movies"

# Create the engine
engine = create_engine(connection_str)

In [5]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
    create_database(connection_str)
    print('Database created')
else:
  print('The database already exists')

The database already exists

# Required Transformation Steps for Title Basics:

## Getting Started with Normalization
In order to normalize genres, we will need to:
 - [x] Convert the single string of genres from title basics into 2 new tables.
    - [x] title_genres: with the columns:
      - [x]  tconst
      - [x]  genre_id

    - [x] genres:
     - [x] genre_id
     - [x] genre_name

Creating these tables will be a multi-step process.
 - [x]  Getting a list of all individual genres.
 - [x]   Create a new title_genres table with with the movie ids duplicated, once for each genre that a movie belongs to.
 - [x] Create a mapper dictionary with numeric ids for each genre.
 - [x] Use the mapper dictionary to replace the string genres in title_genres with numeric genre_ids.
 - [x]  Convert the mapper dictionary into a final genres table with the numeric genre_id and the string genre.

In [6]:
#split the genere column up separating by commas
basics["genres_split"] = basics["genres"].apply(lambda x: x.split(","))
basics["genres_split"].head()

0    [Comedy, Fantasy, Romance]
1                       [Drama]
2                       [Drama]
3      [Comedy, Horror, Sci-Fi]
4                       [Drama]
Name: genres_split, dtype: object

In [7]:
# Apply json.dumps to entire column
#This converts the split string list into json format
basics['genres_split'] = basics['genres_split'].apply(json.dumps)
# Apply json.loads to entire column
basics['genres_split'] = basics['genres_split'].apply(json.loads)
# check results
basics['genres_split'].head()

0    [Comedy, Fantasy, Romance]
1                       [Drama]
2                       [Drama]
3      [Comedy, Horror, Sci-Fi]
4                       [Drama]
Name: genres_split, dtype: object

In [8]:
#Explode on genres_split.  This creates a new entry(row) for each 
# movie for each unique genre.  This will let us get a full list of unique genres
exploded = basics.explode("genres_split")
exploded[["tconst","primaryTitle",'genres', "genres_split"]].head()

,tconst,primaryTitle,genres,genres_split
0,tt0035423,Kate & Leopold,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,Drama,Drama
2,tt0069049,The Other Side of the Wind,Drama,Drama

In [9]:
#List of unique genres
unique_genres = exploded["genres_split"].dropna().unique()

In [10]:
#Create a genre_id map by pairing the unique genres with an incrementing integer
genre_id = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_id))
genre_map

{'Comedy': 0,
 'Fantasy': 1,
 'Romance': 2,
 'Drama': 3,
 'Horror': 4,
 'Sci-Fi': 5,
 'Biography': 6,
 'Mystery': 7,
 'Musical': 8,
 'Action': 9,
 'Adventure': 10,
 'Crime': 11,
 'Thriller': 12,
 'Music': 13,
 'Animation': 14,
 'Family': 15,
 'History': 16,
 'War': 17,
 'Sport': 18,
 'Western': 19,
 'Adult': 20,
 'Short': 21,
 'Reality-TV': 22,
 'News': 23,
 'Talk-Show': 24,
 'Game-Show': 25}

In [11]:
#Create a new title_genres table with with the movie ids duplicated, 
#once for each genre that a movie belongs to.
title_genres = exploded[["tconst","genres_split"]].head()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [12]:
#Use the mapper dictionary to replace the string genres in
#title_genres with numeric genre_ids.
title_genres["genres_id"] = title_genres["genres_split"].map(genre_map)
title_genres.drop(columns = "genres_split", inplace=True)
title_genres.head()

      tconst  genres_id
0  tt0035423          0
0  tt0035423          1
0  tt0035423          2
1  tt0062336          3
2  tt0069049          3

In [13]:
#Convert the mapper dictionary into a final genres table with the
#numeric genre_id and the string genre.
genres = pd.DataFrame({'genre_name':genre_map.keys(),
                             'genre_id':genre_map.values()})
genres.head()

  genre_name  genre_id
0     Comedy         0
1    Fantasy         1
2    Romance         2
3      Drama         3
4     Horror         4

## Discard unecessary info
- Discard unnecessary information:
 - [x] For the title basics table, drop the following columns:
   - [x]  "original_title" (we will use the primary title column instead)
   - [x]   "isAdult" ("Adult" will show up in the genres so this is redundant information).
   - [x]   "titleType" (every row will be a movie).
   - [x]   "genres" and other variants of genre (genre is now represented in the 2 new tables described above.
 - [ ]   Do not include the title_akas table in your SQL database.
   - [ ]  You have already filtered out the desired movies using this table and the remaining data is mostly nulls and not of-interest to the stakeholder.

In [14]:
basics.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres', 'genres_split'],
      dtype='object')

In [15]:
basics.drop(columns = ["originalTitle", "isAdult", "titleType", 
                       "genres","genres_split"], inplace=True)
basics.columns

Index(['tconst', 'primaryTitle', 'startYear', 'endYear', 'runtimeMinutes'], dtype='object')

# MySQL Database Requirements

- [x] Use sqlalchemy with pandas to execute your SQL queries inside your notebook.

- [x] Create a new database on your MySQL server and call it "movies".

- [x] Make sure to have the following tables in your "movies" database:
  - [x] title_basics
  - [x] title_ratings
  - [x] title_genres
  - [x] genres
  - [x] tmdb_data

- [ ]  Make sure to set a Primary Key for each table that isn't a joiner table (e.g. title_genres is a joiner table).

- [ ]  After creating each table, show the first 5 rows of that table using a SQL query.

- [ ] Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

## Saving the MySQL tables with primary keys.

You will need to make sure to set the Primary Key for each table that you create with pandas + sqlalchemy that is not a joiner table. (e.g. title_genres is a joiner table and it does not have a primary key).
- If we had an integer id columns, this would be as simple as:
```
## Set the dataframe index and use index=True 
df.set_index('int_index').to_sql('table_name',engine,index=True)
```
- Because we have a string column ("tconst") as the primary key for several tables, we will need to go through some extra steps.
-  If we do not perform these steps (detailed below) approach, we would run into the an error

---

Using `tconst` as the primary key.

- To use a string column as our primary key, we will need to provide the SQL datatype schema of our columns when we create the table.
- We will then use our engine to run the command to alter our table and add tconst as the primary key.

1. Creating a dataype schema for to_sql:

 - [x] Check the dtypes of your dataframe: (df.dtypes).
   - [x] Create a dictionary with each column name as a key and the corresponding SQL datatype as the value.
 - [x] Find the corresponding SQLalchemy datatype to use in the table below.
 
    | Pandas DataType | SQLAlchemy dataType|
    | - | -|
    | int | 	Integer() |
    | float  |	Float() |
    | bool | 	Boolean() |
    | object (for Primary Keys) 	| String(max_str_len+1) |
    | object (for non-key columns) 	| Text(max_str_len+1) |


**Note on String Columns:**

 - For columns with "object" dtype, you should use:
  - the String type if the column will become your primary key.
  - Otherwise, use the Text datatpye.
  - Both String/Text will need the maximum string length to use for that column.
  - You can find the maximum string length (max_str_len) for any text column using the following code:
 ```
 ## get max string length
max_str_len = df['column'].fillna('').map(len).max()
 ```

### title_basics
- Normalization
 - [x] 1NF - Each column in your table can only have 1 piece of information.
 - [x] 2NF - Each column in your table that is not a key (primary or foreign) must have unique values for every row.
 - [x] 3NF - You cannot have a non-key column that is dependent on another non-key column.
- [x] Primary key = tconst

In [16]:
#Check the dtypes of your dataframe: (df.dtypes).
basics.dtypes

tconst             object
primaryTitle       object
startYear           int64
endYear           float64
runtimeMinutes      int64
dtype: object

In [17]:
#Use custom function to convert to sql-ready
basics_schema = df_to_sql(basics,"tconst")
basics_schema

{'tconst': String(length=11),
 'primaryTitle': Text(length=243),
 'startYear': Integer(),
 'endYear': Float(),
 'runtimeMinutes': Integer()}

In [18]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',
              index=False)

85838

In [19]:
#Run the query to ADD PRIMARY KEY
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [20]:
#Query the table and show first 5 rows
q = '''
SELECT *
FROM title_basics
Limit 5;
'''
pd.read_sql_query(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,None,70
2,tt0069049,The Other Side of the Wind,2018,None,122
3,tt0088751,The Naked Monster,2005,None,100
4,tt0096056,Crime and Punishment,2002,None,126

### title_ratings
- Normalization
 - [x] 1NF - Each column in your table can only have 1 piece of information.
 - [x] 2NF - Each column in your table that is not a key (primary or foreign) must have unique values for every row.
 - [x] 3NF - You cannot have a non-key column that is dependent on another non-key column.
- [x] Primary key = index

In [21]:
ratings.columns

Index(['tconst', 'averageRating', 'numVotes'], dtype='object')

In [22]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1959
1  tt0000002            5.8       263
2  tt0000005            6.2      2596
3  tt0000006            5.1       177
4  tt0000007            5.4       814

In [23]:
ratings['tconst'].unique()

array(['tt0000001', 'tt0000002', 'tt0000005', ..., 'tt9916348',
       'tt9916362', 'tt9916428'], dtype=object)

In [24]:
#Create a ratings_id map by pairing the unique ratings with an incrementing integer
ratings_id = range(len(ratings['tconst'].unique()))
ratings_map = dict(zip(ratings['tconst'].unique(), ratings_id))
#Add ratings_id primary key column
ratings["id"] = ratings["tconst"].map(ratings_map)

In [25]:
ratings.head()

      tconst  averageRating  numVotes  id
0  tt0000001            5.7      1959   0
1  tt0000002            5.8       263   1
2  tt0000005            6.2      2596   2
3  tt0000006            5.1       177   3
4  tt0000007            5.4       814   4

In [26]:
ratings_schema = df_to_sql(ratings)
ratings_schema

{'tconst': Text(length=11),
 'averageRating': Float(),
 'numVotes': Integer(),
 'id': Integer()}

In [27]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings',engine,dtype=ratings_schema,if_exists='replace',
              index=False)

491583

In [29]:
#Run the query to ADD PRIMARY KEY
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`id`);')

In [30]:
#Query the table and show first 5 rows
q = '''
SELECT *
FROM title_ratings
Limit 5;
'''
pd.read_sql_query(q, engine)

      tconst  averageRating  numVotes  id
0  tt0000001            5.7      1959   0
1  tt0000002            5.8       263   1
2  tt0000005            6.2      2596   2
3  tt0000006            5.1       177   3
4  tt0000007            5.4       814   4

### title_genres

In [34]:
#Check the dtypes of your dataframe: (df.dtypes).
title_genres.columns

Index(['tconst', 'genres_id'], dtype='object')

In [32]:
#Use custom function to convert to sql-ready
title_genres_schema = df_to_sql(title_genres)
title_genres_schema

{'tconst': Text(length=10), 'genres_id': Integer()}

In [33]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=title_genres_schema,if_exists='replace',
              index=False)

5

In [35]:
#Query the table and show first 5 rows
q = '''
SELECT *
FROM title_genres
Limit 5;
'''
pd.read_sql_query(q, engine)

      tconst  genres_id
0  tt0035423          0
1  tt0035423          1
2  tt0035423          2
3  tt0062336          3
4  tt0069049          3

### genres

In [36]:
genres.columns

Index(['genre_name', 'genre_id'], dtype='object')

In [37]:
#Use custom function to convert to sql-ready
genres_schema = df_to_sql(genres)
genres_schema

{'genre_name': Text(length=11), 'genre_id': Integer()}

In [38]:
# Save to sql with dtype and index=False
genres.to_sql('genres',engine,dtype=genres_schema,if_exists='replace',
              index=False)

26

In [39]:
#Query the table and show first 5 rows
q = '''
SELECT *
FROM genres
Limit 5;
'''
pd.read_sql_query(q, engine)

  genre_name  genre_id
0     Comedy         0
1    Fantasy         1
2    Romance         2
3      Drama         3
4     Horror         4

### tmdb_data
You only need to keep the `imdb_id`, `revenue`, `budget`, and `certification` columns

In [40]:
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.115,2133.0,PG
1,tt0120467,0.0,/knok3mNReKqPTplnnqz7E4dd7mD.jpg,NaN,120000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 27, 'name...",NaN,19085.0,en,Vulgar,...,14904.0,87.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone loves a clown... some more than others.,Vulgar,0.0,5.500,44.0,R
2,tt0120630,0.0,/t7aJ7hqsMLEoqBJk7yAXxcAVvcz.jpg,"{'id': 718551, 'name': 'Chicken Run Collection...",45000000.0,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",NaN,7443.0,en,Chicken Run,...,224834564.0,84.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,This ain't no chick flick. It's poultry in mot...,Chicken Run,0.0,6.740,4293.0,G
3,tt0120753,0.0,/3vUkQpnwbsFEQlMh9EORpvKJfpo.jpg,NaN,8000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 53, 'name...",NaN,318.0,en,The Million Dollar Hotel,...,105983.0,122.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Everyone has something to hide.,The Million Dollar Hotel,0.0,5.900,270.0,R
4,tt0120755,0.0,/24DZfupDlhXeTchmcOkoGRhP5Vg.jpg,"{'id': 87359, 'name': 'Mission: Impossible Col...",125000000.0,"[{'id': 12, 'name': 'Adventure'}, {'id': 28, '...",NaN,955.0,en,Mission: Impossible II,...,546388105.0,123.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Expect the impossible again.,Mission: Impossible II,0.0,6.112,5657.0,PG-13

In [41]:
tmdb.columns

Index(['imdb_id', 'adult', 'backdrop_path', 'belongs_to_collection', 'budget',
       'genres', 'homepage', 'id', 'original_language', 'original_title',
       'overview', 'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'revenue', 'runtime',
       'spoken_languages', 'status', 'tagline', 'title', 'video',
       'vote_average', 'vote_count', 'certification'],
      dtype='object')

In [42]:
#You only need to keep the imdb_id, revenue, budget, and certification columns
tmdb_req = tmdb[["imdb_id","revenue","budget","certification"]]

In [43]:
#Use custom function to convert to sql-ready
tmdb_schema = df_to_sql(tmdb_req,"imdb_id")
tmdb_schema

{'imdb_id': String(length=11),
 'revenue': Float(),
 'budget': Float(),
 'certification': Text(length=6)}

In [44]:
# Save to sql with dtype and index=False
tmdb_req.to_sql('tmdb_data',engine,dtype=tmdb_schema,if_exists='replace',
              index=False)

1810

In [45]:
#Run the query to ADD PRIMARY KEY
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [46]:
#Query the table and show first 5 rows
q = '''
SELECT *
FROM tmdb_data
Limit 5;
'''
pd.read_sql_query(q, engine)

     imdb_id      revenue      budget certification
0  tt0035423   76019000.0  48000000.0         PG-13
1  tt0118589    5271670.0  22000000.0         PG-13
2  tt0118694   12855000.0    150000.0            PG
3  tt0120467      14904.0    120000.0             R
4  tt0120630  224835000.0  45000000.0             G